Revit 2027 API
BasicFileInfo.AllLocalChangesSavedToCentral Property
 Are all local changes saved to the central file?
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllLocalChangesSavedToCentral { get; }
Public ReadOnly Property AllLocalChangesSavedToCentral As Boolean
	Get
public:
property bool AllLocalChangesSavedToCentral {
	bool get ();
}
member AllLocalChangesSavedToCentral : bool with get
Property Value
Boolean
See Also
Reference
BasicFileInfo Class
Autodesk.Revit.DB Namespace